"""
Сформировать файл с выбором чисел участниками лотереи.
**Техническое задание:**
1. Задан файл со списком фамилий участников [surnames.txt](https://drive.google.com/file/d/1fz3G7pdJ6iyGrgXT_B9Mh_wGQBZrlSbV/view?usp=share_link) (файл так же можно взять из задания 9.1).
2. Каждый из них случайным образом выбирает 10 чисел в диапазоне от 1 до 99. Генерацию случайных чисел сделать с помощью пакета random.
3. Для всех участников: фамилию участника и выбранные им числа записать в другой файл в формате csv с разделителем #.
**Пример:**
Сформировать файл с выбором чисел участниками лотереи.
Новиков#72#2#6#11#38#3#28#55#27#10
Федоров#67#32#61#34#90#13#9#90#87#96
Морозов#96#23#44#26#61#81#47#21#15#13"""

